# -*- ispell-dictionary: "sr"; -*-
#+TITLE: Програмски језик Раст
#+SUBTITLE: Базирано на верзији 1.65.0. У изради.
#+EXPORT_FILE_NAME: index.html
#+EXPORT_REVEAL_HLEVEL: 10
#+SETUPFILE: ../../courses-startup-cyr.org

*** Искази и изрази
- Рaст је језик базиран на изразима (/expression-based/)
- Искази (/statements/) су језичке конструкције које немају повратну вредност.
  Изрази (/expressions/) се евалуирају у одређени резултат, тј. имају вредност.
- Пример: =let= је исказ тј. нема повратну вредност. Ово можете писати:
  #+begin_src rust
  let y = 6;
  #+end_src
  Ali ovo ne:
  #+begin_src rust
  let x = (let y = 6);
  #+end_src

#+REVEAL: split

Блок кода је такође израз. Шта је вредност у коју се евалуира?

#+begin_src rust
{
    let x = 3;
    x + 1
}
#+end_src

Вредност блока је вредност последњег израза, тј. =x+1=. Приметите да ту не
користимо =;= јер терминација овим карактером претвара израз у исказ.

#+REVEAL: split

Због овога је сасвим легално да пишемо:

#+begin_src rust
fn main() {
    let y = {
        let x = 3;
        x + 1
    };

    println!("The value of y is: {}", y);
}
#+end_src

#+RESULTS:
: The value of y is: 4
*** Повратне вредности функција
Вредност функције је вредност блока који представља тело функције, дакле
последњег израза унутар тела функције.

#+begin_src rust
fn five() -> i32 {
    5
}

fn main() {
    let x = five();

    println!("The value of x is: {}", x);
}
#+end_src

#+RESULTS:
: The value of x is: 5

#+REVEAL: split

Или на пример:
#+begin_src rust
fn main() {
    let x = plus_one(5);

    println!("The value of x is: {}", x);
}

fn plus_one(x: i32) -> i32 {
    x + 1
}
#+end_src

#+RESULTS:
: The value of x is: 6

#+REVEAL: split

Уколико израз =x+1= терминирамо са =;= код се неће компајлирати јер функција
декларише да враћа тип =i32= док сада враћа =()= (тзв. /unit type/) односно нема
повратну вредност јер је последња инструкција исказ.

#+begin_src rust
fn main() {
    let x = plus_one(5);

    println!("The value of x is: {}", x);
}

fn plus_one(x: i32) -> i32 {
    x + 1;
}
#+end_src

#+begin_example
error[E0308]: mismatched types
 --> src/main.rs:8:24
  |
8 | fn plus_one(x: i32) -> i32 {
  |    --------            ^^^ expected `i32`, found `()`
  |    |
  |    implicitly returns `()` as its body has no tail or `return` expression
9 |     x + 1;
  |          - help: consider removing this semicolon

For more information about this error, try `rustc --explain E0308`.
error: could not compile `cargo4UyKF0` due to previous error
#+end_example

*** =if= у =let= исказима
=if= је израз па се може користити где год можемо писати и било који други израз.

#+begin_src rust
fn main() {
    let condition = true;
    let number = if condition { 5 } else { 6 };

    println!("The value of number is: {}", number);
}
#+end_src

#+RESULTS:
: The value of number is: 5

#+REVEAL: split

Али се гране морају слагати по типу. Ово је погрешно јер је прва грана типа
=i32= док је =else= грана типа =str=.

#+begin_src rust
fn main() {
    let condition = true;

    let number = if condition { 5 } else { "six" };

    println!("The value of number is: {}", number);
}
#+end_src
*** =for=
Итерацију кроз уређену колекцију, као што је низ, можемо обавити са =while= петљом.
#+begin_src rust
fn main() {
    let a = [10, 20, 30, 40, 50];
    let mut index = 0;

    while index < 5 {
        println!("the value is: {}", a[index]);

        index += 1;
    }
}
#+end_src

#+REVEAL: split
Али је за ту намену природније и сигурније користити =for= петљу. Такође ће се
програм брже извршавати.

#+begin_src rust
fn main() {
    let a = [10, 20, 30, 40, 50];

    for element in a {
        println!("the value is: {}", element);
    }
}
#+end_src

#+REVEAL: split
=for= петље су најчешћи облик петљи у употреби у Расту. Користе се нпр. и у
ситуацији када је потребно извршити петљу одређени број пута.

#+begin_src rust
fn main() {
    for number in (1..4).rev() {
        println!("{}!", number);
    }
    println!("LIFTOFF!!!");
}
#+end_src

#+RESULTS:
: 3!
: 2!
: 1!
: LIFTOFF!!!

